---
kind: enumMember
id: F:Autodesk.Revit.DB.WallSweepType.Sweep
enum: Autodesk.Revit.DB.WallSweepType
source: html/f66354e5-a9c6-de97-695c-4a2fba036232.htm
---
# Autodesk.Revit.DB.WallSweepType.Sweep

Represents a wall sweep.